/* Dialog title when quitting */
"Do you really want to quit X11?" = "هل ترغب حقًا في إنهاء X11؟";

/* Dialog when quitting */
"Any open X11 applications will stop immediately, and you will lose any unsaved changes." = "سيتم إيقاف أية تطبيقات X11 مفتوحة على الفور، وسيتم فقد أية تغييرات لم يتم حفظها.";

/* Dialog title when switching to RandR */
"Enter RandR mode?" = "الدخول إلى وضع RandR؟";

/* Dialog when switching to RandR */
"An application has requested X11 to change the resolution of your display.  X11 will restore the display to its previous state when the requesting application requests to return to the previous state.  Alternatively, you can use the ⌥⌘A key sequence to force X11 to return to the previous state." = "يطلب تطبيق من X11 تغيير دقة شاشة العرض.  سيقوم X11 باستعادة حالة شاشة العرض السابقة عند طلب التطبيق المطالب العودة إلى الحالة السابقة. وكبديل لذلك، يمكنك استخدام تسلسل المفاتيح ⌥⌘A لفرض استعادة X11 الحالة السابقة.";

/* No comment provided by engineer. */
"Allow" = "السماح";

/* No comment provided by engineer. */
"Always Allow" = "السماح دومًا";

/* No comment provided by engineer. */
"Cancel" = "إلغاء";

/* No comment provided by engineer. */
"Mac Help" = "مساعدة Mac";

/* No comment provided by engineer. */
"Quit" = "إنهاء";

/* No */
"No" = "لا";

/* Yes */
"Yes" = "نعم";

/* Terminal */
"Terminal" = "الوحدة الطرفية";

/* Startup xinitrc dialog */
"You have an existing ~/.xinitrc file.\n\nWindows displayed by X11 applications may not have titlebars, or may look different to windows displayed by native applications.\n\nWould you like to move aside the existing file and use the standard X11 environment the next time you start X11?" = "يوجد لديك ملف ~/.xinitrc.\n\nربما لا تحتوي النوافذ التي تعرضها تطبيقات X11 على أشرطة عناوين, أو قد تبدو مختلفة عن النوافذ التي تعرضها التطبيقات الأصلية.\n\nهل ترغب في استبعاد الملف الموجود واستخدام بيئة X11 القياسية عند بدء تشغيل X11 في المرة التالية؟";

/* window item modifiers */
"window item modifiers" = "الأوامر";

/* Updates menu title … */
"Check for X11 Updates..." = "التحقق من وجود تحديثات X11...";
